app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = $1 LIMIT $2  [["post_id", 1], ["LIMIT", 1]]
---
  def show
    @comment = Comment.where(post_id: params[:id])