app/controllers/posts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts"
---
  def index
    if params[:id]
      @user = User.find(params[:id])
      @posts = @user.posts
    else
      @posts = Post.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def search
    @post = Post.find_by(id: params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]
---
  def destroy
    @post = Post.find_by(id: params[:id])
    @post.destroy

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "upvotes" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["upvotes", 1], ["updated_at", 2017-02-28 21:06:06 UTC], ["id", 1]]
---
  def upvote
    @post = Post.find(id: params[:id])
    @post.increment!(:upvotes)