app/controllers/users_controller.rb

  def index
    @user = User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "bio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "my_username"], ["email", "test@example.com"], ["bio", "My funky bio"], ["created_at", 2017-02-28 19:11:56 UTC], ["updated_at", 2017-02-28 19:11:56 UTC]]

  def search
    @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]